scripts/org/my-html.org
#+TITLE: HTML
#+AUTHOR: Shirishkumar Togarla
#+PROPERTY: header-args :tangle (f-expand (concat (f-base (buffer-file-name)) ".el") "../src")
* Package Initialization
#+begin_src elisp
;;; my-html.el --- Configuration to be loaded while starting emacs
;;; Commentary

;; The `my-html' package is used to load the required configuration
#+end_src
* Web Mode
#+begin_src elisp
(use-package web-mode
  :ensure t
  :mode ("\\.html$" . web-mode)
  :init
  (setq web-mode-markup-indent-offset 2)
  (setq web-mode-code-indent-offset 2)
  (setq web-mode-css-indent-offset 2)
  (setq js-indent-level 2)
  (setq web-mode-enable-auto-pairing t)
  (setq web-mode-enable-auto-expanding t)
  (setq web-mode-enable-css-colorization t)
  (add-hook 'web-mode-hook 'electric-pair-mode))
#+end_src
* Prettier formatting
#+begin_src elisp
;; Prettier formatting
;; `NOTE': npm -g install prettier
(use-package prettier-js
  :ensure t
  :init
  (add-hook 'html-mode 'prettier-js-mode)
  (add-hook 'web-mode 'prettier-js-mode)
  (add-hook 'js-mode 'prettier-js-mode)
  (add-hook 'js2-mode 'prettier-js-mode)
  (add-hook 'css-mode 'prettier-js-mode))
#+end_src
* emmet-mode
#+begin_src elisp
(use-package emmet-mode
  :ensure t
  :commands emmet-mode
  :init
  (setq emmet-indentation 2)
  (setq emmet-move-cursor-between-quotes t)
  :config
  (add-hook 'sgml-mode-hook 'emmet-mode) ;; Auto-start on any markup modes
  (add-hook 'css-mode-hook  'emmet-mode)
  (add-hook 'web-mode 'prettier-js-mode)
  )
#+end_src
* Package End
#+begin_src elisp
(provide 'my-html)

;;; my-html package ends here

#+end_src
